Revit 2027 API
View.GetViewDisplayModel Method
 Returns the current view display model settings for the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ViewDisplayModel GetViewDisplayModel()
Public Function GetViewDisplayModel As ViewDisplayModel
public:
ViewDisplayModel^ GetViewDisplayModel()
member GetViewDisplayModel : unit -> ViewDisplayModel
Return Value
ViewDisplayModel
 Current view display model settings.
See Also
Reference
View Class
Autodesk.Revit.DB Namespace